[
  {
    "id": 1,
    "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "translation": "Our Lord, give us in this world good and in the Hereafter good, and protect us from the punishment of the Fire.",
    "reference": "Quran 2:201"
  },
  {
    "id": 2,
    "arabic": "رَبِّ زِدْنِي عِلْمًا",
    "translation": "My Lord, increase me in knowledge.",
    "reference": "Quran 20:114"
  },
  {
    "id": 3,
    "arabic": "رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا",
    "translation": "Our Lord, do not impose blame upon us if we forget or make a mistake.",
    "reference": "Quran 2:286"
  },
  {
    "id": 4,
    "arabic": "رَبِّ اشْرَحْ لِي صَدْرِي • وَيَسِّرْ لِي أَمْرِي",
    "translation": "My Lord, expand for me my breast and ease for me my task.",
    "reference": "Quran 20:25-26"
  },
  {
    "id": 5,
    "arabic": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
    "translation": "Our Lord, grant us from our spouses and offspring comfort to our eyes, and make us leaders for the righteous.",
    "reference": "Quran 25:74"
  },
  {
    "id": 6,
    "arabic": "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ",
    "translation": "My Lord, I seek refuge in You from the whisperings of the devils.",
    "reference": "Quran 23:97"
  },
  {
    "id": 7,
    "arabic": "رَبِّ إِنِّي مَغْلُوبٌ فَانْتَصِرْ",
    "translation": "My Lord, I am overpowered, so help me.",
    "reference": "Quran 54:10"
  },
  {
    "id": 8,
    "arabic": "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ",
    "translation": "My Lord, do not leave me alone, while You are the best of inheritors.",
    "reference": "Quran 21:89"
  },
  {
    "id": 9,
    "arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا",
    "translation": "Our Lord, pour upon us patience and make our steps firm.",
    "reference": "Quran 2:250"
  },
  {
    "id": 10,
    "arabic": "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
    "translation": "Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.",
    "reference": "Quran 7:23"
  }
]
